### 데이터프레임
- 2차원 배열
- 2차원 벡터, 행렬
- 열 == 속성 == 항목
- 행 == 레코드 == 줄
- 예) 주식종목 행 - 관측값 열 - 종목코드,회사이름,액면가,총 주식수

In [1]:
# 데이터프레임 만들기
import pandas as pd
dict_data = {'c0':[1,2,3,] ,'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}
df = pd.DataFrame(dict_data , index=['A','B','C'])
df.columns = ['초1','초2','초3','초4','초5']
print(df)

   초1  초2  초3  초4  초5
A   1   4   7  10  13
B   2   5   8  11  14
C   3   6   9  12  15

In [2]:
# 데이터프레임 만들기
import pandas as pd
info_data = {'name':['Kim','Lee','Park'] ,'age':[24,27,34],'children':[2,1,3]}
inf = pd.DataFrame(info_data)
print(inf)

   name  age  children
0   Kim   24         2
1   Lee   27         1
2  Park   34         3

In [3]:
# pd.DataFrame (2차원배열, index = 행 인덱스 배열, columns = 열 이름 배열)
d_2 = [[15,'남','구봉중'],[18,'여','봉우중']]
df2 = pd.DataFrame (d_2)
df2.index = ['1반','2반']
df2.columns = ['나이','성별','중학교명']
print(df2)
# rename
df2 = df2.rename(index={'1반':'준서','2반':'예은'})
df2 = df2.rename(columns={'중학교명':'학교'})
print(df2)
# drop '예은' 삭제하기 
df2 = df2.drop('예은', axis=0)
print(df2)
# drop '나이' 삭제하기 
df2 = df2.drop('나이', axis=1)
print(df2)

    나이 성별 중학교명
1반  15  남  구봉중
2반  18  여  봉우중
    나이 성별   학교
준서  15  남  구봉중
예은  18  여  봉우중
    나이 성별   학교
준서  15  남  구봉중
   성별   학교
준서  남  구봉중

In [4]:
# 예제 1-7)
exam_data = {'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
print(df)
# DataFrame을 copy하여 변수 df2에 저장, df2의 1개 행 삭제
df2 = df.copy()
df2 = df2.drop('우현', axis=0)
print(df2)
# 우현,인아 둘 다 삭제
df3 = df.copy()
df3 = df3.drop(['우현','인아'], axis=0)
df3

    수학  영어   음악   체육
서준  90  97   95  100
우현  80  82   85   90
인아  70  95  100   90
    수학  영어   음악   체육
서준  90  97   95  100
인아  70  95  100   90

    수학  영어  음악   체육
서준  90  97  95  100

In [5]:
# 선택
exam_data = {'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])

label1 = df.loc['서준']
print(label1)

label2 = df.iloc[1]
print(label2)

수학     90
영어     97
음악     95
체육    100
Name: 서준, dtype: int64
수학    80
영어    82
음악    85
체육    90
Name: 우현, dtype: int64

In [6]:
# 데이터프레임 문제 1)
fastfood = {'food':['KFC','McDonald','schoolFood'],'price':[1000,2000,2500],'rating':[4.5,3.9,4.2]}
ff = pd.DataFrame(fastfood)
print()

In [7]:
# 데이터프레임 문제 2)
fastfood = {'food':['KFC','McDonald','schoolFood'],'price':[1000,2000,2500],'rating':[4.5,3.9,4.2]}
ff = pd.DataFrame(fastfood)
print(ff[['food','rating']])

         food  rating
0         KFC     4.5
1    McDonald     3.9
2  schoolFood     4.2

In [8]:
# 데이터프레임 문제 3)
fastfood = {'food':['KFC','McDonald','schoolFood'],'price':[1000,2000,2500],'rating':[4.5,3.9,4.2]}
ff = pd.DataFrame(fastfood)
ff = ff.rename(columns={'food':'place'})
print(ff)

        place  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  schoolFood   2500     4.2

In [9]:
# 선택
exam_data = {'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])

label = df.loc[['서준','우현']]
position = df.iloc[[0,1]]
print(label)
print(position)
print('\n')
label1 = df.loc['서준':'우현']
position1 = df.iloc[0:1]
print(label1)
print(position1)
print('\n')
math = df['수학']
print(math)
print('\n')
english = df.영어
english

    수학  영어  음악   체육
서준  90  97  95  100
우현  80  82  85   90
    수학  영어  음악   체육
서준  90  97  95  100
우현  80  82  85   90


    수학  영어  음악   체육
서준  90  97  95  100
우현  80  82  85   90
    수학  영어  음악   체육
서준  90  97  95  100


서준    90
우현    80
인아    70
Name: 수학, dtype: int64

서준    97
우현    82
인아    95
Name: 영어, dtype: int64

In [10]:
exam_data = {'이름':['서준','우현','인아'],'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  97   95  100
1  우현  80  82   85   90
2  인아  70  95  100   90

In [11]:
exam_data = {'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])

mus_pys = df[['음악','체육']]
mus_pys

     음악   체육
서준   95  100
우현   85   90
인아  100   90

In [12]:
df.iloc[::]

    수학  영어   음악   체육
서준  90  97   95  100
우현  80  82   85   90
인아  70  95  100   90

In [13]:
df.iloc[1::]

    수학  영어   음악  체육
우현  80  82   85  90
인아  70  95  100  90

In [14]:
df.iloc[::-1]

    수학  영어   음악   체육
인아  70  95  100   90
우현  80  82   85   90
서준  90  97   95  100

In [15]:
exam_data = {'이름':['서준','우현','인아'],'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data)

print(df)
print('\n')
df = df.set_index('이름')
print(df)

   이름  수학  영어   음악   체육
0  서준  90  97   95  100
1  우현  80  82   85   90
2  인아  70  95  100   90


    수학  영어   음악   체육
이름
서준  90  97   95  100
우현  80  82   85   90
인아  70  95  100   90

In [16]:
exam_data = {'이름':['서준','우현','인아'],'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data)

df = df.set_index('이름')
df.loc['서준',['음악','체육']]

음악     95
체육    100
Name: 서준, dtype: int64

In [17]:
# 열 추가
exam_data = {'이름':['서준','우현','인아'],'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data)

df['국어'] = 80
df['과학'] = [80,75,90]

# 행 추가
df.loc[3] = ['지아',100,89,95,85,90,100]
df

   이름   수학  영어   음악   체육  국어   과학
0  서준   90  97   95  100  80   80
1  우현   80  82   85   90  80   75
2  인아   70  95  100   90  80   90
3  지아  100  89   95   85  90  100

In [18]:
exam_data = {'이름':['서준','우현','인아'],'수학':[90,80,70],'영어':[97,82,95],'음악':[95,85,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data)

# 행 추가
df.loc[3] = 0
df.loc[4] = ['동규',90,80,70,60]
df

   이름  수학  영어   음악   체육
0  서준  90  97   95  100
1  우현  80  82   85   90
2  인아  70  95  100   90
3   0   0   0    0    0
4  동규  90  80   70   60

In [19]:
exam_data = {'이름':['서준','우현','인아'],
             '수학':[90,80,70],
             '영어':[97,82,95],
             '음악':[95,85,100],
             '체육':[100,90,90]}
df = pd.DataFrame(exam_data)

# 행 추가
df.loc[3] = 0
df.loc[4] = ['동규',90,80,70,60]
df = df.set_index('이름')
df

    수학  영어   음악   체육
이름
서준  90  97   95  100
우현  80  82   85   90
인아  70  95  100   90
0    0   0    0    0
동규  90  80   70   60

In [20]:
# 원소값 변경
df.loc['서준',['음악','체육']] = 80
df

    수학  영어   음악  체육
이름
서준  90  97   80  80
우현  80  82   85  90
인아  70  95  100  90
0    0   0    0   0
동규  90  80   70  60

In [14]:
# 인덱스 활용
import pandas as pd
exam_data = {'이름':['서준','우현','인아'],
             '수학':[90,80,70],
             '영어':[97,82,95],
             '음악':[95,85,100],
             '체육':[100,90,90]}
df = pd.DataFrame(exam_data)
df_name = df.set_index('이름')
df_name
# 번호 새롭게 멀티 인덱스
number = [251011, 240218, 190305]
df.set_index([pd.Index(number),'이름'])

           수학  영어   음악   체육
       이름
251011 서준  90  97   95  100
240218 우현  80  82   85   90
190305 인아  70  95  100   90

In [16]:
# 행 인덱스 재배열 reindex()
# 예제 1-17
import pandas as pd
dict_data = {'c0': [1, 2, 3], 'c1': [4, 5, 6], 'c2': [7, 8, 9], 'c3': [10, 11, 12], 'c4': [13, 14, 15]}
df = pd.DataFrame(dict_data, index = ['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [19]:
# 문제 1)
import pandas as pd
data = {'이름': ['철수', '영희', '민수'],
             '국어': [90, 70, 85],
             '영어': [85, 95, 80],
             '수학': [80, 100, 90]}
df = pd.DataFrame(data)
df.set_index('이름')

    국어  영어   수학
이름
철수  90  85   80
영희  70  95  100
민수  85  80   90

In [162]:
# 문제 2)
import pandas as pd
data = {'주문번호': ['1001', '1002', '1003'],
             '상품명': ['키보드', '모니터', '마우스'],
             '수량': [2, 1, 3],
             '단가': [30000, 150000, 20000]}
df = pd.DataFrame(data)
df.set_index('주문번호')

      상품명  수량      단가
주문번호
1001  키보드   2   30000
1002  모니터   1  150000
1003  마우스   3   20000

In [160]:
# 문제 3)
data2 = {
    'Name': ['철수', '영희', '민수'],
    'Age': [16, 17, 16],
    'Class': ['A', 'B', 'A']}
df = pd.DataFrame(data2)
df1 = df.set_index('Name')
df1.columns = ['나이','반']
df1

      나이  반
Name
철수    16  A
영희    17  B
민수    16  A

In [187]:
# 문제 4)
import pandas as pd
data = {'주문번호': ['1001', '1002', '1003'],
        '고객명': ['김철수', '이영희', '박민수'],
        '상품명': ['키보드', '모니터', '마우스'],
        '수량': [2, 1, 3],
        '가격': [3000, 150000, 20000]}
df = pd.DataFrame(data)
df2 = df.drop([1])
df3 = df2.drop('가격', axis=1)
df3

   주문번호  고객명  상품명  수량
0  1001  김철수  키보드   2
2  1003  박민수  마우스   3

In [189]:
# 문제 5)
import pandas as pd
data = {'주문번호': ['1001', '1002', '1003'],
        '고객명': ['김철수', '이영희', '박민수'],
        '상품명': ['키보드', '모니터', '마우스'],
        '수량': [2, 1, 3],
        '단가': [30000, 150000, 20000]}
df = pd.DataFrame(data)
label = df.loc[1]
print(label)
print('-----------↑ 요구1 ↑ -- ↓ 요구2 ↓------------')
d_e = df[['수량', '단가']]
print(d_e)
print('-----------↑ 요구2 ↑ -- ↓ 요구3 ↓------------')
b_c = df.iloc[0:2:1, [2, 3]]
b_c

주문번호      1002
고객명        이영희
상품명        모니터
수량           1
단가      150000
Name: 1, dtype: object
-----------↑ 요구1 ↑ -- ↓ 요구2 ↓------------
   수량      단가
0   2   30000
1   1  150000
2   3   20000
-----------↑ 요구2 ↑ -- ↓ 요구3 ↓------------

   상품명  수량
0  키보드   2
1  모니터   1

In [198]:
# 문제 6)
import pandas as pd
data = {'이름': ['철수', '영희', '민수'],
             '국어': [90, 70, 85],
             '영어': [85, 95, 80],
             '수학': [80, 100, 90]}
df = pd.DataFrame(data)
df.iloc[1,3] = 98
df.iloc[2,2] = 82
df.set_index('이름')

    국어  영어  수학
이름
철수  90  85  80
영희  70  95  98
민수  85  82  90

In [202]:
# 문제6 키보드로 입력받아서 수정하기
data = {
    "이름": ["철수", "영희", "민수"],
    "국어": [90, 70, 85],
    "영어": [85, 95, 80],
    "수학": [80, 100, 90]
}
df = pd.DataFrame( data )
df=df.set_index( '이름' )
df.loc[ '영희', '수학' ] = 98
df.loc['민수','영어'] = 82

# name = input('점수 변경할 학생의 이름을 입력해주세요 : ')
# sub = input('변경할 과목명을 입력해주세요 : ')
# score = input('변경할 점수을 입력해주세요 : ')
# df.loc [name, sub] = score
# df

점수 변경할 학생의 이름을 입력해주세요 :  d
변경할 과목명을 입력해주세요 :  d
변경할 점수을 입력해주세요 :  d

      국어    영어    수학    d
이름
철수  90.0  85.0  80.0  NaN
영희  70.0  95.0  98.0  NaN
민수  85.0  82.0  90.0  NaN
d    NaN   NaN   NaN    d

In [209]:
# 문제 7)
import pandas as pd
data = {'주문번호': ['1001', '1002', '1003'],
        '고객명': ['김철수', '이영희', '박민수'],
        '상품명': ['키보드', '모니터', '단가'],
        '수량': [2, 1, 3],
        '단가': [30000, 150000, 20000]}
df = pd.DataFrame(data)
df = df.set_index('주문번호')
a = df.loc['1002', ['고객명', '상품명']]
a

고객명    이영희
상품명    모니터
Name: 1002, dtype: object

In [240]:
# 문제 8)

data = {'주문번호': [1001, 1002, 1003],
        '고객명': ['김철수', '이영희', '박민수'],
        '상품명': ['키보드', '모니터', '마우스']}
df = pd.DataFrame(data)
df = df.set_index('주문번호')
df = df.reindex([1003, 1001, 1004, 1002])
df

      고객명  상품명
주문번호
1003  박민수  마우스
1001  김철수  키보드
1004  NaN  NaN
1002  이영희  모니터

In [237]:
# 문제 9)
import pandas as pd
data = {'고객명': ['김철수', '이영희', '박민수'],
        '상품명': ['키보드', '모니터', '마우스'],
        '수량': [2, 1, 3]}
df = pd.DataFrame(data)
a = df.set_index('고객명')
print(a)
print('---------------------------')
a.reset_index()

     상품명  수량
고객명
김철수  키보드   2
이영희  모니터   1
박민수  마우스   3
---------------------------

   고객명  상품명  수량
0  김철수  키보드   2
1  이영희  모니터   1
2  박민수  마우스   3

In [247]:
# 내림차순
dict_data = {'c0': [1, 2, 3], 'c1': [4, 5, 6], 'c2': [7, 8, 9], 'c3': [10, 11, 12], 'c4': [13, 14, 15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
ndf = df.sort_index(ascending=False)
print(ndf)
# 오름차순
dict_data = {'c0': [1, 2, 3], 'c1': [4, 5, 6], 'c2': [7, 8, 9], 'c3': [10, 11, 12], 'c4': [13, 14, 15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
ndf = df.sort_index(ascending=True)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [257]:
# c1을 기준으로 내림차순 정렬
dict_data = {'c0': [10, 2, 3], 'c1': [20, 51, 6], 'c2': [70, 18, 89], 'c3': [10, 2, 10], 'c4': [3, 74, 15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
ndf = df.sort_values(by='c3', ascending=False)
ndf

    c0  c1  c2  c3  c4
r0  10  20  70  10   3
r2   3   6  89  10  15
r1   2  51  18   2  74

In [10]:
# 산술연산
import pandas as pd
sr = pd.Series({'국어': 100, '영어': 80, '수학': 90, '학점': 'A+'})
sr

국어    100
영어     80
수학     90
학점     A+
dtype: object

In [31]:
# Series + Series
student1 = pd.Series({'국어': 100, '영어': 80, '수학': 90})
student2 = pd.Series({'국어': 80, '영어': 80, '수학': 90})
a = student1 + student2
b = student1 - student2
c = student1 * student2
d = student1 / student2
df = pd.DataFrame([a, b, c, d], index=['+', '-', '*', '/'])
df
# astype(int)
df = pd.DataFrame([a, b, c, d], index=['+', '-', '*', '/'])
df

        국어      영어      수학
+   180.00   160.0   180.0
-    20.00     0.0     0.0
*  8000.00  6400.0  8100.0
/     1.25     1.0     1.0

In [33]:
import pandas as pd
student1 = pd.Series({
                        '국어':100,
                        '영어':80,
                        '수학':90,})
student2 = pd.Series({
                        '수학':100,
                        '국어':80,
                        '영어':90,})
덧셈 = student1 + student2
뺄셈 = student1 - student2
곱셈 = student1 * student2
나눗셈 = round(student1 / student2, 2)

df = pd.DataFrame([덧셈, 뺄셈, 곱셈, 나눗셈], index=['합', '차', '곱', '나누기']).T
df

        합     차       곱   나누기
국어  180.0  20.0  8000.0  1.25
수학  190.0 -10.0  9000.0  0.90
영어  170.0 -10.0  7200.0  0.89

In [35]:
# 연산 메소드
import pandas as pd
import numpy as np

student1 = pd.Series({'국어': np.nan, '영어': 80, '수학': 90})
student2 = pd.Series({'영어': 80, '수학': 90})

sr_add = student1.add(student2, fill_value=0)  # 덧셈
sr_sub = student1.sub(student2, fill_value=0)  # 뺄셈
sr_mul = student1.mul(student2, fill_value=0)  # 곱셈
sr_div = student1.div(student2, fill_value=0)  # 나눗셈

result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div], index=['+', '-', '*', '/'])
result

   국어      수학      영어
+ NaN   180.0   160.0
- NaN     0.0     0.0
* NaN  8100.0  6400.0
/ NaN     1.0     1.0